"""
Примеры ввода и вывода данных

В соревнованиях по программированию очень важно быстро и правильно
читать входные данные и выводить результаты.
"""

# ============================================
# Пример 1: Читаем одно число
# ============================================
print("=== Пример 1: Читаем одно число ===")
print("Введите число:")
# n = int(input())
# print(f"Вы ввели: {n}")

# ============================================
# Пример 2: Читаем два числа в одной строке
# ============================================
print("\n=== Пример 2: Два числа через пробел ===")
print("Введите два числа через пробел (например: 5 10):")
# a, b = map(int, input().split())
# print(f"a = {a}, b = {b}")
# print(f"Их сумма: {a + b}")

# ============================================
# Пример 3: Читаем массив чисел
# ============================================
print("\n=== Пример 3: Массив чисел ===")
print("Введите числа через пробел (например: 1 2 3 4 5):")
# arr = list(map(int, input().split()))
# print(f"Массив: {arr}")
# print(f"Сумма элементов: {sum(arr)}")

# ============================================
# Пример 4: Читаем n чисел (каждое с новой строки)
# ============================================
print("\n=== Пример 4: n чисел с новых строк ===")
print("Сколько чисел вы введете?")
# n = int(input())
# numbers = []
# print(f"Введите {n} чисел:")
# for i in range(n):
#     numbers.append(int(input()))
# print(f"Ваши числа: {numbers}")

# Более короткий способ:
# n = int(input())
# numbers = [int(input()) for i in range(n)]

# ============================================
# Пример 5: Выводим массив
# ============================================
print("\n=== Пример 5: Выводим массив ===")
arr = [1, 2, 3, 4, 5]

# Способ 1: Через пробел (самый частый в соревнованиях)
print("Массив через пробел:", end=" ")
print(*arr)  # 1 2 3 4 5

# Способ 2: Через запятую
print("Массив через запятую:", ','.join(map(str, arr)))

# Способ 3: Каждый элемент с новой строки
print("Массив столбиком:")
for x in arr:
    print(x)

# ============================================
# Пример 6: Типичная структура решения задачи
# ============================================
print("\n=== Пример 6: Типичная структура ===")
print("""
# Задача: Дан массив чисел. Найти и вывести максимальное число.

def solve():
    # Читаем размер массива
    n = int(input())

    # Читаем сам массив
    arr = list(map(int, input().split()))

    # Находим максимум
    result = max(arr)

    # Выводим ответ
    print(result)

# Запускаем решение
# solve()
""")

# ============================================
# Пример 7: Несколько тестов
# ============================================
print("\n=== Пример 7: Несколько тестов ===")
print("""
# Часто в задачах нужно решить несколько независимых тестов
# Формат ввода:
# Первая строка: t - количество тестов
# Далее идут t тестов

def solve():
    n = int(input())
    arr = list(map(int, input().split()))
    result = max(arr)
    print(result)

# Читаем количество тестов
t = int(input())

# Решаем каждый тест
for _ in range(t):
    solve()
""")

# ============================================
# Пример 8: Работа со строками
# ============================================
print("\n=== Пример 8: Чтение строк ===")
print("Введите строку:")
# s = input()  # читаем строку
# s = input().strip()  # читаем строку и убираем пробелы по краям

# Читаем несколько слов
print("Введите несколько слов через пробел:")
# words = input().split()  # разбиваем на слова
# print(f"Слова: {words}")
# print(f"Количество слов: {len(words)}")

print("\n=== Конец примеров ===")
print("\nВсе закомментированные строки с input() можно раскомментировать")
print("и запустить программу, чтобы попрактиковаться!")
